Backend2/SyncUpAPI/app/controllers/api/v1/events_controller.rb

  def index
    @events = Event.all
    modifiedEvents = []
    @events.each do |event|
      event.tags ||= []
      event.tags << "music" << "games"
---
SELECT "events".* FROM "events"
INSERT INTO "events" ("title", "description", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "My FUn Event"], ["description", "Come and have some fun now!"], ["date", "2018-11-15"], ["created_at", "2018-11-12 19:08:32.522573"], ["updated_at", "2018-11-12 19:08:32.522573"]]

  def create
    @event = Event.create(event_params)
---
INSERT INTO "events" ("title", "description", "date", "tags", "created_at", "updated_at", "address") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"