Backend2/SyncUpAPI/app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Big Booty Ho From THa Restaurant"], ["email", "jimcrowlaws@compassion.org"], ["created_at", "2018-11-12 20:46:47.984367"], ["updated_at", "2018-11-12 20:46:47.984367"]]
---
  def create
    @user = User.create(user_params)